CarND/UdacityCarNDDeepLearningEnvironmentSetup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-01-25 Wed 23:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>udacity 无人驾驶课程 开发环境配置过程</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shen.mutong" />
</head>
<body>
<div id="content">
<h1 class="title">udacity 无人驾驶课程 开发环境配置过程</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb0f3a07">1. 介绍</a></li>
<li><a href="#orgedb4832">2. 软硬件环境</a></li>
<li><a href="#org718cae6">3. 配置python开发环境(pyenv 和 anaconda)</a>
<ul>
<li><a href="#org3a94f21">3.1. 安装pyenv</a></li>
<li><a href="#org082f70e">3.2. 安装python(anaconda)</a></li>
<li><a href="#orgfdfa99e">3.3. pyenv 使用</a></li>
</ul>
</li>
<li><a href="#org7efcdc2">4. 安装tensorflow</a>
<ul>
<li><a href="#org1107f76">4.1. 安装pip</a></li>
<li><a href="#org5dfe55f">4.2. 安装CUDA</a></li>
<li><a href="#org9892d12">4.3. 安装tensorflow</a></li>
</ul>
</li>
<li><a href="#org3f49db6">5. jupyter notebook 远程配置</a></li>
<li><a href="#orga9b2383">6. 参考</a></li>
<li><a href="#orge070d60">7. 联系</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb0f3a07" class="outline-2">
<h2 id="orgb0f3a07"><span class="section-number-2">1</span> 介绍</h2>
<div class="outline-text-2" id="text-1">
<p>
目前在学习优达学城的无人驾驶课程，在DeepLearning这一阶段的学习过程中，使用的了anaconda和tensorflow，在此过程中出现了一些问题。最终解决，现记录一下。
</p>
</div>
</div>
<div id="outline-container-orgedb4832" class="outline-2">
<h2 id="orgedb4832"><span class="section-number-2">2</span> 软硬件环境</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">系统</td>
<td class="org-left">ubuntu 16.04 64bit</td>
</tr>

<tr>
<td class="org-left">shell</td>
<td class="org-left">zsh</td>
</tr>

<tr>
<td class="org-left">型号</td>
<td class="org-left">alw15</td>
</tr>

<tr>
<td class="org-left">内存</td>
<td class="org-left">16G</td>
</tr>

<tr>
<td class="org-left">独立显卡</td>
<td class="org-left">Nvdia Geforce 970m</td>
</tr>

<tr>
<td class="org-left">硬盘</td>
<td class="org-left">128G SSD +1TB HD</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org718cae6" class="outline-2">
<h2 id="org718cae6"><span class="section-number-2">3</span> 配置python开发环境(pyenv 和 anaconda)</h2>
<div class="outline-text-2" id="text-3">
<p>
考虑到系统初始版本python为2.7.更改后可能使用其他软件会存在问题，如geeknote等，所以首先安装pyenv.
</p>
</div>
<div id="outline-container-org3a94f21" class="outline-3">
<h3 id="org3a94f21"><span class="section-number-3">3.1</span> 安装pyenv</h3>
<div class="outline-text-3" id="text-3-1">
<p>
执行 ： 
</p>
<div class="org-src-container">
<pre class="src src-bash">url -L https://raw.githubusercontent.com/yyuu/pyenv-installer/master/bin/pyenv-installer | bash
</pre>
</div>
<p>
在~/.zshrc 中加入如下：
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #A6E22E;">export</span> <span style="color: #F92672;">PATH</span>=<span style="color: #E6DB74;">"/home/shenmutong/.pyenv/bin:$PATH"</span>
<span style="color: #A6E22E;">eval</span> <span style="color: #E6DB74;">"$(pyenv init -)"</span>
<span style="color: #A6E22E;">eval</span> <span style="color: #E6DB74;">"$(pyenv virtualenv-init -)"</span>
</pre>
</div>
<p>
完成后执行source ~/.zshrc,使操作生效。
</p>
</div>
</div>
<div id="outline-container-org082f70e" class="outline-3">
<h3 id="org082f70e"><span class="section-number-3">3.2</span> 安装python(anaconda)</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-bash">pyenv install --list  <span style="color: #465457; font-style: italic;">#</span><span style="color: #465457; font-style: italic;">&#21015;&#20986;pyenv&#21487;&#20197;&#23433;&#35013;&#30340;python &#29256;&#26412;&#12290;</span>
</pre>
</div>
<p>
使用pyenv 安装python 版本，可以直接执行:
</p>
<div class="org-src-container">
<pre class="src src-bash">pyenv install anaconda3-4.2.0
</pre>
</div>
<p>
因为我是在中国，所以因为你懂得的原因过程异常痛苦，所以直接在 <a href="https://www.continuum.io/downloads">anaconda下载地址</a> 下载python3.5 version的 anaconda4.2.0 for linux。
下载好的文件是'Anaconda3-4.2.0-Linux-x86<sub>64.sh</sub>。复制或移动该文件到~/.pyenv/cache/下，然后执行
</p>
<div class="org-src-container">
<pre class="src src-bash">pyenv install anaconda3-4.2.0
</pre>
</div>
<p>
pyenv在安装之前会在~/.pyenv/cache 查找是否存在安装包，若存在，则会直接进行安装。
另外，记得好像可以更换pyenv 的源，没有去确定，各位也可以试一下。
</p>
</div>
</div>
<div id="outline-container-orgfdfa99e" class="outline-3">
<h3 id="orgfdfa99e"><span class="section-number-3">3.3</span> pyenv 使用</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-bash">pyenv rehash <span style="color: #465457; font-style: italic;"># </span><span style="color: #465457; font-style: italic;">&#26356;&#26032;&#25968;&#25454;&#24211;</span>
<span style="color: #465457; font-style: italic;">#</span><span style="color: #465457; font-style: italic;">&#22312;&#23433;&#35013; Python &#25110;&#32773;&#20854;&#20182;&#24102;&#26377;&#21487;&#25191;&#34892;&#25991;&#20214;&#30340;&#27169;&#22359;&#20043;&#21518;&#65292;&#38656;&#35201;&#23545;&#25968;&#25454;&#24211;&#36827;&#34892;&#26356;&#26032;</span>

pyenv versions <span style="color: #465457; font-style: italic;"># </span><span style="color: #465457; font-style: italic;">&#26597;&#30475;&#24403;&#21069;&#24050;&#23433;&#35013;&#30340; python &#29256;&#26412;</span>
pyenv global anaconda3-4.2.0 <span style="color: #465457; font-style: italic;">#</span><span style="color: #465457; font-style: italic;">&#35774;&#32622;&#20840;&#23616;&#30340; python &#29256;&#26412;</span>
pyenv local anaconda3-4.2.0 <span style="color: #465457; font-style: italic;"># </span><span style="color: #465457; font-style: italic;">&#26356;&#25913;&#24403;&#21069;&#30446;&#24405;&#19979;python&#29256;&#26412;</span>
pyenv shell anaconda3-4.2.0 <span style="color: #465457; font-style: italic;"># </span><span style="color: #465457; font-style: italic;">&#26356;&#25913;&#24403;&#21069;shell&#29615;&#22659;&#19979; python &#29256;&#26412;</span>

pyenv uninstall <span style="color: #465457; font-style: italic;">#</span><span style="color: #465457; font-style: italic;">&#21368;&#36733;&#26576;&#20010;&#29256;&#26412;python</span>
pyenv update <span style="color: #465457; font-style: italic;"># </span><span style="color: #465457; font-style: italic;">&#26356;&#26032; pyenv &#21450;&#20854;&#25554;&#20214;</span>
</pre>
</div>

<p>
更多使用可以参考<a href="https://github.com/yyuu/pyenv">https://github.com/yyuu/pyenv</a>
至此python环境 安装完成。
</p>
</div>
</div>
</div>
<div id="outline-container-org7efcdc2" class="outline-2">
<h2 id="org7efcdc2"><span class="section-number-2">4</span> 安装tensorflow</h2>
<div class="outline-text-2" id="text-4">
<p>
注意：如果没有CUDA SDK 情况下直接安装tensorflow gpu 版本的话，在使用过程中使用import tensorflow 会出现一个比较奇怪的错误，
'Error importing tensorflow. Unless you are using bazel, you should not try to import tensorflow from its source directory '。
当时脑残的用了很久来解决这个问题，后来才发现是因为没有安装CUDASDK的原因。
</p>
</div>
<div id="outline-container-org1107f76" class="outline-3">
<h3 id="org1107f76"><span class="section-number-3">4.1</span> 安装pip</h3>
<div class="outline-text-3" id="text-4-1">
<p>
如果没有安装pip的话 ，使用该命令进行安装。
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt-get install python-pip python-dev
</pre>
</div>
</div>
</div>


<div id="outline-container-org5dfe55f" class="outline-3">
<h3 id="org5dfe55f"><span class="section-number-3">4.2</span> 安装CUDA</h3>
<div class="outline-text-3" id="text-4-2">
<p>
一下内容直接复制于  <a href="https://www.tensorflow.org/get_started/os_setup#optional_install_cuda_gpus_on_linux">https://www.tensorflow.org/get_started/os_setup#optional_install_cuda_gpus_on_linux</a>
Check NVIDIA Compute Capability of your GPU card
</p>

<p>
<a href="https://developer.nvidia.com/cuda-gpus">https://developer.nvidia.com/cuda-gpus</a>
</p>

<p>
Download and install Cuda Toolkit
</p>

<p>
<a href="https://developer.nvidia.com/cuda-downloads">https://developer.nvidia.com/cuda-downloads</a>
</p>

<p>
Install version 8.0 if using our binary releases.
</p>

<p>
Install the toolkit into e.g. /usr/local/cuda.
</p>

<p>
Download and install cuDNN
</p>

<p>
<a href="https://developer.nvidia.com/cudnn">https://developer.nvidia.com/cudnn</a>
</p>

<p>
Download cuDNN v5.1.
</p>

<p>
Uncompress and copy the cuDNN files into the toolkit directory. Assuming the toolkit is installed in /usr/local/cuda, run the following commands (edited to reflect the cuDNN version you downloaded):
</p>
<div class="org-src-container">
<pre class="src src-bash">tar xvzf cudnn-8.0-linux-x64-v5.1-ga.tgz
sudo cp -P cuda/include/cudnn.h /usr/local/cuda/include
sud&#29255;&#65374;o cp -P cuda/lib64/libcudnn* /usr/local/cuda/lib64
sudo chmod a+r /usr/local/cuda/include/cudnn.h /usr/local/cuda/lib64/libcudnn*
<span style="color: #465457; font-style: italic;">#</span><span style="color: #465457; font-style: italic;">Install other dependencies</span>
sudo apt-get install libcupti-dev
</pre>
</div>
</div>
</div>
<div id="outline-container-org9892d12" class="outline-3">
<h3 id="org9892d12"><span class="section-number-3">4.3</span> 安装tensorflow</h3>
<div class="outline-text-3" id="text-4-3">
<p>
在使用anaconda配置的 目录下，或切换当前shell到andconda 环境中。
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #465457; font-style: italic;"># </span><span style="color: #465457; font-style: italic;">Ubuntu/Linux 64-bit, CPU only, Python 3.5</span>
<span style="color: #A6E22E;">export</span> <span style="color: #F92672;">TF_BINARY_URL</span>=https://storage.googleapis.com/tensorflow/linux/cpu/tensorflow-0.12.1-cp35-cp35m-linux_x86_64.whl
<span style="color: #465457; font-style: italic;"># </span><span style="color: #465457; font-style: italic;">Ubuntu/Linux 64-bit, GPU enabled, Python 3.5</span>
<span style="color: #465457; font-style: italic;"># </span><span style="color: #465457; font-style: italic;">Requires CUDA toolkit 8.0 and CuDNN v5. For other versions, see "Installing from sources" below.</span>
<span style="color: #A6E22E;">export</span> <span style="color: #F92672;">TF_BINARY_URL</span>=https://storage.googleapis.com/tensorflow/linux/gpu/tensorflow_gpu-0.12.1-cp35-cp35m-linux_x86_64.whl
pip3 install --upgrade $<span style="color: #F92672;">TF_BINARY_URL</span>
</pre>
</div>
<p>
搞定
</p>
</div>
</div>
</div>
<div id="outline-container-org3f49db6" class="outline-2">
<h2 id="org3f49db6"><span class="section-number-2">5</span> jupyter notebook 远程配置</h2>
<div class="outline-text-2" id="text-5">
<p>
有时间再写。
</p>
</div>
</div>
<div id="outline-container-orga9b2383" class="outline-2">
<h2 id="orga9b2383"><span class="section-number-2">6</span> 参考</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="https://github.com/yyuu/pyenv">https://github.com/yyuu/pyenv</a>
<a href="https://www.tensorflow.org/get_started/os_setup#optional_install_cuda_gpus_on_linux">https://www.tensorflow.org/get_started/os_setup#optional_install_cuda_gpus_on_linux</a>
</p>
</div>
</div>
<div id="outline-container-orge070d60" class="outline-2">
<h2 id="orge070d60"><span class="section-number-2">7</span> 联系</h2>
<div class="outline-text-2" id="text-7">
<p>
如果大家有问题，欢迎讨论。我的邮箱是
shenmutong@hotmail.com</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: shen.mutong</p>
<p class="date">Created: 2017-01-25 Wed 23:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>